---
kind: property
id: P:Autodesk.Revit.DB.RelinquishOptions.CheckedOutElements
source: html/f27cd543-0f50-245d-bf54-fd96e044ada1.htm
---
# Autodesk.Revit.DB.RelinquishOptions.CheckedOutElements Property

True means all elements checked out by the current user should be relinquished.
 False means none of these are relinquished.

## Syntax (C#)
```csharp
public bool CheckedOutElements { get; set; }
```